
    // Запитуємо в користувача довжину масиву
    let length = prompt("Введіть довжину масиву:");

    // Створюємо порожній масив
    let array = [];

    // Заповнюємо масив елементами, які вводить користувач
    for (var i = 0; i < length; i++) {
    let element = prompt("Введіть елемент масиву на позиції " + i + ":");
    array.push(element);
}

    // Виводимо початковий масив
    document.write("Початковий масив: " + array.join(', ') + "<br>");

    // Сортуємо масив за зростанням
    array.sort();

    // Виводимо відсортований масив
    document.write("Відсортований масив: " + array.join(', ') + "<br>");

        // Видаляємо елементи з 2 по 4 (включно)
        array.splice(1, 3);

        // Виводимо масив після видалення елементів
        document.write("Масив після видалення елементів: " + array.join(', ') + "<br>");
